{
  "navigation": {
    "home": "Accueil",
    "about": "À Propos",
    "projects": "Projets",
    "skills": "Compétences",
    "experience": "Expérience",
    "blog": "Blog",
    "testimonials": "Témoignages",
    "contact": "Contact"
  },
  "intro": {
    "greeting": "Bonjour, je suis Amin,",
    "role": "un",
    "title": "développeur Laravel",
    "experience": "3+ ans",
    "description": "d'expérience. Je me spécialise dans la création",
    "focus": "d'applications web modernes",
    "with": "avec",
    "tech": "Laravel, Livewire, Filament, Alpine.js et Tailwind CSS",
    "contactButton": "Contactez-moi ici",
    "downloadCV": "Télécharger CV"
  },
  "about": {
    "title": "À Propos de Moi",
    "description": "Bonjour, je suis Mohamed Amin Smida — un développeur de logiciels de 22 ans avec une forte passion pour la création d'applications web fiables et évolutives.",
    "background": "Avec plus de 3 ans d'expérience en Laravel, j'ai également travaillé intensivement avec Node.js, NestJS et le CMS Directus. Je poursuis actuellement mon diplôme d'ingénieur tout en travaillant comme développeur backend dans une entreprise technologique à Tunis.",
    "approach": "Tout au long de ma carrière, j'ai contribué à des projets à grande échelle, acquérant une expérience pratique dans la résolution de problèmes réels et la livraison de solutions de haute qualité qui font la différence. Si vous recherchez quelqu'un qui est engagé, minutieux et facile à collaborer — j'aimerais vous aider à donner vie à vos idées."
  },
  "projects": {
    "title": "Mes Projets",
    "viewGithub": "Voir sur GitHub",
    "viewDemo": "Démo en direct",
    "keyFeatures": "Fonctionnalités & Compétences Clés:",
    "laravel": {
      "title": "Laravel",
      "description": "Développement de systèmes backend sophistiqués avec le framework Laravel, en mettant l'accent sur l'évolutivité et la performance. Création d'APIs RESTful, implémentation de logiques métier complexes et optimisation des requêtes de base de données pour des applications à fort trafic. Expertise dans l'écosystème Laravel incluant les événements, les files d'attente et les fournisseurs de services."
    },
    "reverb": {
      "title": "Laravel Reverb",
      "description": "Développement de systèmes de communication en temps réel avec Laravel Reverb, créant des applications réactives et interactives. Implémentation de solutions WebSocket pour les notifications instantanées, les tableaux de bord en direct et les applications de chat. Conception d'une architecture de diffusion évolutive avec authentification sécurisée et gestion efficace des canaux."
    },
    "filament": {
      "title": "Filament",
      "description": "Création de panneaux d'administration sophistiqués et d'interfaces CRUD avec Laravel Filament. Développement de plugins et composants personnalisés pour étendre les fonctionnalités, créant des tableaux de bord administratifs intuitifs et puissants pour la gestion de contenu."
    },
    "vue": {
      "title": "Vue.js",
      "description": "Conception d'interfaces utilisateur dynamiques et réactives avec Vue.js, créant des expériences utilisateur fluides. Développement d'applications à page unique avec une architecture basée sur les composants, gestion d'état avec Vuex et routage côté client. Implémentation de liaison de données réactive et optimisation du rendu pour des applications web haute performance."
    }
  },
  "skills": {
    "title": "Mes Compétences"
  },
  "experience": {
    "title": "Mon Expérience",
    "trisoweb": {
      "title": "Stagiaire en Ingénierie Logicielle",
      "location": "Trisoweb, Tunisie",
      "description": "Contribution au développement fullstack d'une plateforme e-commerce utilisant Laravel et Vue.js, en se concentrant sur la création d'APIs RESTful évolutives et la conception d'une architecture de base de données PostgreSQL robuste. Intégration de composants Vue.js dynamiques et collaboration avec des développeurs seniors pour améliorer les performances du système et assurer les meilleures pratiques de développement.",
      "date": "2022 (3 mois)"
    },
    "satoripop": {
      "title": "Stagiaire Développeur Backend",
      "location": "Satoripop, Tunisie",
      "description": "Développement de fonctionnalités clés pour une plateforme d'engagement client multicanal (similaire à Brevo/Mailchimp) utilisant Laravel et Vue.js. Implémentation d'endpoints API sécurisés pour les services d'email, SMS et notifications push, et contribution au système de file d'attente de messages pour la livraison de campagnes à haut volume.",
      "date": "2023"
    },
    "education": {
      "title": "Licence en Sciences Appliquées et Technologie",
      "location": "Institut Supérieur des Sciences Appliquées et de Technologie de Sousse, Tunisie",
      "description": "Suivi de cours rigoureux sur les fondamentaux de l'ingénierie logicielle, les structures de données, les algorithmes et les technologies de développement web. Développement de solides compétences en résolution de problèmes grâce à des projets pratiques et des travaux d'équipe collaboratifs. Diplômé avec mention, démontrant l'excellence académique.",
      "date": "2023"
    },
    "laravel": {
      "title": "Développeur Laravel",
      "location": "Freelance, Tunisie",
      "description": "Conception et développement d'applications web de niveau entreprise utilisant les technologies de l'écosystème Laravel. Spécialisation dans la conception d'API RESTful, l'optimisation de bases de données et l'implémentation de logiques métier complexes. Concentration sur la livraison de solutions évolutives et maintenables avec une couverture de tests complète et des pratiques CI/CD modernes.",
      "date": "2023 - présent"
    }
  },
  "blog": {
    "title": "Derniers Articles",
    "readMore": "Lire plus",
    "viewAll": "Voir tous les articles"
  },
  "testimonials": {
    "title": "Ce que Disent les Gens"
  },
  "contact": {
    "title": "Contactez-Moi",
    "nameLabel": "Votre nom",
    "emailLabel": "Votre email",
    "messageLabel": "Votre message",
    "submitButton": "Envoyer",
    "successMessage": "Merci pour votre message! Je vous répondrai bientôt.",
    "errorMessage": "Une erreur s'est produite. Veuillez réessayer.",
    "emailText": "Contactez-moi directement à",
    "formText": "ou via ce formulaire."
  },
  "footer": {
    "copyright": " 2024 Amin. Tous droits réservés.",
    "builtWith": "Construit avec Next.js et Tailwind CSS"
  },
  "theme": {
    "light": "Mode clair",
    "dark": "Mode sombre"
  }
}